In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

### 0.0.1 Built-in functions

In [28]:
df = pd.read_csv("data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [29]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [30]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [31]:
dict(enumerate(sorted(df["race"].unique())))

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

In [32]:
list(enumerate(sorted(df["race"].unique())))

[(0, 'black'), (1, 'hispanic'), (2, 'other'), (3, 'white')]

In [33]:
np.array(list(enumerate(sorted(df["race"].unique()))))

array([['0', 'black'],
       ['1', 'hispanic'],
       ['2', 'other'],
       ['3', 'white']], dtype='<U11')

In [34]:
np.array(list(enumerate(sorted(df["race"].unique()))))[:,0]

array(['0', '1', '2', '3'], dtype='<U11')

In [35]:
np.array(list(enumerate(sorted(df["race"].unique()))))[:,1]

array(['black', 'hispanic', 'other', 'white'], dtype='<U11')

In [36]:
np.array(list(enumerate(sorted(df["race"].unique()))))[:,0].tolist()

['0', '1', '2', '3']

In [37]:
list(enumerate(sorted(df["race"].unique())))

[(0, 'black'), (1, 'hispanic'), (2, 'other'), (3, 'white')]

In [38]:
np.array(list(enumerate(sorted(df["race"].unique()))))

array([['0', 'black'],
       ['1', 'hispanic'],
       ['2', 'other'],
       ['3', 'white']], dtype='<U11')

In [39]:
np.array(list(enumerate(sorted(df["race"].unique()))))[:,1]

array(['black', 'hispanic', 'other', 'white'], dtype='<U11')

In [40]:
np.array(list(enumerate(sorted(df["race"].unique()))))[:,1].tolist()

['black', 'hispanic', 'other', 'white']

In [41]:
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:,0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:,1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [42]:
# df["race"].replace(key, value)

In [43]:
# df["race"].replace(to_replace = key, value = value, inplace = True)

In [44]:
df["race"].replace(key, value, inplace=True)

In [45]:
df["race"].head()

0    0
1    0
2    0
3    1
4    0
Name: race, dtype: int64

In [46]:
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:,1].tolist()

value, key

([0, 1], ['male', 'female'])

In [47]:
# df["sex"].replace(to_replace=key, value=value, inplace=True)
# df.haed(5)

In [48]:
df["sex"].replace(key, value, inplace=True)
df.head(5)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

In [49]:
df.sum(axis=0)

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [50]:
df.sum(axis=1).head()

0    79710.189011
1    96542.218643
2    48824.436947
3    80654.316153
4    82213.425498
dtype: float64

In [51]:
df.isnull().head()

    earn  height    sex   race     ed    age
0  False   False  False  False  False  False
1  False   False  False  False  False  False
2  False   False  False  False  False  False
3  False   False  False  False  False  False
4  False   False  False  False  False  False

In [52]:
df.isnull().sum(0)

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [54]:
df.sort_values(["age", "earn"], ascending=False).head(10)

              earn  height  sex  race  ed  age
3     80478.096153   63.22    1     1  16   95
809   42963.362005   72.94    0     0  12   95
331   39169.750135   64.79    1     0  12   95
102   39751.194030   67.14    0     0  12   93
993   32809.632677   59.61    1     1  16   92
1017   8942.806716   62.97    1     0  10   91
1192  39757.947210   64.79    0     0  16   90
952    8162.682672   58.09    1     0   5   89
827   55712.348432   70.13    0     0   9   88
939   40744.874765   59.15    1     0  15   87

In [55]:
df.cumsum().head(5)

            earn  height  sex  race    ed    age
0   79571.299011   73.89  0.0   0.0  16.0   49.0
1  175968.287654  140.12  1.0   0.0  32.0  111.0
2  224678.954602  203.89  2.0   0.0  48.0  144.0
3  305157.050754  267.11  3.0   1.0  64.0  239.0
4  387246.396253  330.19  4.0   1.0  81.0  282.0

In [56]:
df.cummax().head(10)

           earn  height  sex  race    ed   age
0  79571.299011   73.89  0.0   0.0  16.0  49.0
1  96396.988643   73.89  1.0   0.0  16.0  62.0
2  96396.988643   73.89  1.0   0.0  16.0  62.0
3  96396.988643   73.89  1.0   1.0  16.0  95.0
4  96396.988643   73.89  1.0   1.0  17.0  95.0
5  96396.988643   73.89  1.0   1.0  17.0  95.0
6  96396.988643   73.89  1.0   1.0  17.0  95.0
7  96396.988643   73.89  1.0   1.0  17.0  95.0
8  96396.988643   73.89  1.0   2.0  17.0  95.0
9  96396.988643   73.89  1.0   2.0  17.0  95.0

In [57]:
df.sort_values("age", ascending=False).head(10)

              earn  height  sex  race  ed  age
3     80478.096153   63.22    1     1  16   95
331   39169.750135   64.79    1     0  12   95
809   42963.362005   72.94    0     0  12   95
102   39751.194030   67.14    0     0  12   93
993   32809.632677   59.61    1     1  16   92
1017   8942.806716   62.97    1     0  10   91
1192  39757.947210   64.79    0     0  16   90
952    8162.682672   58.09    1     0   5   89
827   55712.348432   70.13    0     0   9   88
1068  10861.092284   64.03    1     0  13   87

In [58]:
df.age.corr(df.earn)

0.07400349177836055

In [59]:
df.age[(df.age < 45) & (df.age > 15)].corr(df.earn)

0.31411788725189044

In [60]:
df24 = df[(df.age > 20) & (df.age < 45)]
df24.age.corr(df24.earn)

0.31411788725189044

In [62]:
df.age.cov(df.earn)

36523.6992104089

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
earn      1379 non-null float64
height    1379 non-null float64
sex       1379 non-null int64
race      1379 non-null int64
ed        1379 non-null int64
age       1379 non-null int64
dtypes: float64(2), int64(4)
memory usage: 64.7 KB

In [64]:
df.sex = df.sex.map(int)
df.race = df.race.map(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
earn      1379 non-null float64
height    1379 non-null float64
sex       1379 non-null int64
race      1379 non-null int64
ed        1379 non-null int64
age       1379 non-null int64
dtypes: float64(2), int64(4)
memory usage: 64.7 KB

In [66]:
df.corr()

            earn    height       sex      race        ed       age
earn    1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036
race   -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000

In [67]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [68]:
df.sex.value_counts(sort=True)

1    859
0    520
Name: sex, dtype: int64

In [69]:
df.race.value_counts(sort=True)

0    1147
3     126
2      77
1      29
Name: race, dtype: int64